{
    "name": "Zeremonie-Grundlagen",
    "icon": "minecraft:air",
    "category": "totemic:ceremonies",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "$(thing)Zeremonien$() sind ein Weg für Totemisten, die Kraft von $(l:basics/music)Melodie$() zu bündeln, um sie dann in einem großen Stoß freizusetzen und kraftvolle Effekte zu erzeugen. Anders als $(l:basics/totem_effects)Totemeffekte$() sind die Effekte von Zeremonien viel mächtiger, aber zeitlich begrenzt.$(br2)Der Mittelpunkt einer jeden Zeremonie ist ein $(l:basics/totem_poles)Totempfahl$(): Dorthin wird die Melodie"
        },
        {
            "type": "patchouli:text",
            "text": "geleitet und von dort werden die Effekte freigesetzt. Um eine Zeremonie zu beginnen, musst du zwei Musikinstrumente im $(thing)Auswahlmodus$() spielen, das geht, indem du sie während des $(emph)Schleichens$() spielst. Welche zwei Instrumente du spielst, entscheidet dabei, welche Zeremonie du auswählst. Spielst du zum Beispiel zweimal die $(l:instruments/drum)Trommel$() während du schleichst, aktivierst du die $(l:ceremonies/war_dance)Kriegstanz$()-Zeremonie.$(br2)Wenn du die Zeremonie ausgewählt hast, musst du"
        },
        {
            "type": "patchouli:text",
            "text": "$(l:basics/music)Melodie$() in den Totempfahl leiten, bis er genug gesammelt hat, um den Effekt der Zeremonie freizusetzen. Dafür hast du nur eine $(emph)begrenzte Zeit$() zur Verfügung, und jedes Instrument kann nur solange gespielt werden, bis seine $(l:basics/music)Melodieobergrenze$() erreicht ist, das heißt also, dass eine Zeremonie nicht mit nur einem Instrument ausgeführt werden kann. $(emph)Weißer Rauch$() aus der Totembasis zeigt an, dass die Melodieobergrenze des Instrumentes erreicht ist, in diesem Fall solltest du"
        },
        {
            "type": "patchouli:text",
            "text": "bis zum Ende der Zeremonie $(emph)aufhören$(), dieses Instrument zu spielen.$(br2)Da die Zeit begrenzt ist, ist die Spielgeschwindigkeit wichtig, und man sollte auf das $(emph)Timing$() und den $(emph)Rhythmus$() zwischen den verschiedenen Instrumenten achten. Es braucht eventuell etwas Übung, um die schwierigeren Zeremonien durchzuführen.$(br2)Ein Linksklick mit dem $(l:basics/totemic_staff)Totemstab$() auf die Totembasis bricht jede Zeremonie und"
        },
        {
            "type": "patchouli:text",
            "text": "Selektion darauf ab.$(br2)$(o)Tipps für Zeremonien:$()$(li)Wenn du eine Zeremonie ausgewählt hast, musst du $(emph)aufhören, zu schleichen$(), damit die Melodie für die Zeremonie gezählt wird.$(li)$(l:instruments/wind_chime)Windspiele$() spielen in ungefähr gleichen Zeitabständen. Versuche, deine Zeremonie daran auszurichten.$(li)Mehrere gleiche Instrumente helfen normalerweise nicht viel. Versuche, so viele $(emph)verschiedene Instrumente$() wie möglich zu verwenden."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)Allerdings kann es hilfreich sein, zwei $(l:instruments/drum)Trommeln$() und zwei oder drei $(l:instruments/wind_chime)Windspiele$() zu haben.$(li)Wenn du eine $(l:instruments/rattle)Rassel$() in der Haupthand und eine $(l:instruments/flute)Flöte$() in der Zweithand hälst, kannst du sie beide gleichzeitig spielen.$(li)Die verfügbare Zeit für eine Zeremonie hängt von der $(emph)Schwierigkeitsstufe$() des Spiels ab."
        }
    ],
    "priority": true
}
